---
kind: type
id: T:Autodesk.Revit.DB.ExportFontTableIterator
source: html/3ecdd8b3-57ff-9ec7-8f48-d381414413de.htm
---
# Autodesk.Revit.DB.ExportFontTableIterator

An iterator to a set of font table.

## Syntax (C#)
```csharp
public class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
```